org/_posts/2011-09-30-testing-cascalog-with-midje.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: Testing Cascalog with Midje
---

<p class="meta">30 Sept 2011 - San Francisco</p>
#+END_HTML

* Testing Cascalog with Midje

I've been working on a Cascalog testing suite these past few weeks, an extension to Brian Marick's [[https://github.com/marick/Midje][Midje]], that eases much of the pain of testing MapReduce workflows. I think a lot of the dull work we see in the Hadoop community is a direct result of fear. Without proper tests, Hadoop developers can't help but be scared of making changes to production code. When creativity might bring down a workflow, it's easiest to get it working once and leave it alone.

The antidote to all of this fear is a functional testing suite. As I discussed in [[http://sritchie.github.com/2011/09/29/getting-creative-with-mapreduce.html][Getting Creative with MapReduce]], Hadoop workflows are difficult to test at all; testing application logic in isolation of data storage is impossible.

Cascalog is free of this weakness. [[https://github.com/sritchie/midje-cascalog][midje-cascalog]] allows you to test Cascalog queries as pure functions, both in isolation and as components of more complicated workflows. the resulting tests are truly beautiful.

I'll start by introducing midje-cascalog's testing operators, then move on to a Cascalog implementation of Word Count, tests included. You can find all source code from this post [[https://github.com/sritchie/cascalog-testing-demo][on github]].

** Testing Operators

In this section, I'll discuss midje-cascalog's testing operators: =fact?-= and =fact?<-=. (The syntax mirrors =?-= and =?<-=, Cascalog's [[http://www.assembla.com/spaces/cascalog/wiki/Defining_and_executing_queries][query execution operators]].) These operators provide the abstractions necessary for testing complex Cascalog workflows. Add them to your namespace by including =(:use midje.cascalog)= in the namespace header.

*** fact?- 

Let's begin by defining a function to test:

#+begin_src clojure
  (defn mk-inc-query [src]
    (<- [?a ?b]
        (src ?a)
        (inc ?a :> ?b)))
#+end_src

=mk-inc-query= accepts a source of 1-tuples and returns a query that generates 2-tuples. To test that =mk-inc-query= actually does this, you need to:

- supply =mk-inc-query= with tuples and
- check that it produces an expected set of result tuples.

Each of the following forms uses the =fact?-= operator to state a distinct "fact" about our query. =fact?-= expects a sequence of result tuples followed by the query tasked with producing them.

These two facts about =mk-inc-query= are true, and pass:

#+begin_src clojure
  ;; The query returned by (mk-inc-query [[1]]),
  ;; when executed,
  ;; returns a single tuple: [1 2]
  (fact?- [[1 2]]
          (mk-inc-query [[1]])) ;; fact is true!
  
  ;; The query returned by (mk-inc-query [[1] [10]]),
  ;; When executed,
  ;; returns two tuples: [10 11] and [1 2]
  (fact?- [[10 11]
           [1 2]]
          (mk-inc-query [[1] [10]])) ;; fact is true!
#+end_src

This fact is false, and fails:

#+begin_src clojure
  ;; The query returned by (mk-inc-query [[1]]),
  ;; when executed,
  ;; returns a single tuple: ["fail!" 10].
  (fact?- [["fail!" 10]]
          (mk-inc-query [[1]])) ;; fact is FALSE!  
#+end_src

=fact?-= can take multiples pairs of result-tuples and queries:

#+begin_src clojure
  ;; Same as two true facts above.
  (fact?- [[1 2]]
          (mk-inc-query [[1]])
  
          [[10 11] [1 2]]
          (mk-inc-query [[1] [10]])) ;; both facts are true!
#+end_src

Strings are ignored wherever they appear, so feel free to pepper your facts with comments.

#+begin_src clojure
  (fact?- "These results:"
          [[1 2]]
  
          "Are produced by this query:"
          (mk-inc-query [[1]])) ;; true  
#+end_src

Note that facts don't have to be top level forms. It's perfectly acceptable to wrap facts in =let=, if it makes the test clearer:

#+begin_src clojure
  (let [src     [[1]]
        results [[1 2]]]
    (fact?- results (mk-inc-query src))) ;; true
#+end_src

**** Custom Log Levels

Cascalog pipes quite a bit of logging to =stdout=. Facts suppress this logging by default, only showing entries with a FATAL log level.

If you want to see more information on fact execution, you customize the log level by placing a keyword at the beginning of your fact:

#+begin_src clojure  
  (fact?- :info
          [[1 2]] (mk-inc-query [[1]])) ;; true
#+end_src

As of version 0.2.1, =midje-cascalog= supports the following log-level keywords, and defaults to =:fatal=:

#+begin_src clojure
:off
:fatal
:warn
:info
:debug
#+end_src

*** fact?<- 

The =fact?<-= operator allows you to define a test a query within the same form. The following two facts are equivalent:

#+begin_src clojure
  (let [src [[1]]]
    (fact?- [[1 2]]
            (<- [?a ?b]
                (src ?a)
                (inc ?a :> ?b)))) ;; true
  
  (let [src [[1]]]
    (fact?<- [[1 2]]
             [?a ?b]
             (src ?a)
             (inc ?a :> ?b))) ;; true
#+end_src

Where =fact?-= is useful for testing full queries and workflows, I find =fact?<-= useful mostly for testing how =def*op= functions behave inside of queries.

