_posts/2011-09-30-testing-cascalog-with-midje.html
---
layout: post
title: Testing Cascalog with Midje
---

<p class="meta">30 Sept 2011 - San Francisco</p>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Testing Cascalog with Midje </h2>
<div class="outline-text-2" id="text-1">


<p>
I've been working on a Cascalog testing suite these past few weeks, an extension to Brian Marick's <a href="https://github.com/marick/Midje">Midje</a>, that eases much of the pain of testing MapReduce workflows. I think a lot of the dull work we see in the Hadoop community is a direct result of fear. Without proper tests, Hadoop developers can't help but be scared of making changes to production code. When creativity might bring down a workflow, it's easiest to get it working once and leave it alone.
</p>
<p>
The antidote to all of this fear is a functional testing suite. As I discussed in a <a href="http://sritchie.github.com/2011/09/29/getting-creative-with-mapreduce.html">Getting Creative with MapReduce</a>, Hadoop workflows are difficult to test at all; testing application logic in isolation of data storage is impossible.
</p>
<p>
Cascalog is free of this weakness. <a href="https://github.com/sritchie/midje-cascalog">midje-cascalog</a> allows you to test Cascalog queries as pure functions, both in isolation and as components of more complicated workflows. the resulting tests are truly beautiful.
</p>
<p>
I'll start by introducing midje-cascalog's testing operators, then move on to a Cascalog implementation of Word Count, tests included. You can find all source code from this post <a href="https://github.com/sritchie/cascalog-testing-demo">on github</a>.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Testing Operators </h3>
<div class="outline-text-3" id="text-1-1">


<p>
In this section, I'll discuss midje-cascalog's testing operators: <code>fact?-</code> and <code>fact?&lt;-</code>. (The syntax mirrors <code>?-</code> and <code>?&lt;-</code>, Cascalog's <a href="http://www.assembla.com/spaces/cascalog/wiki/Defining_and_executing_queries">query execution operators</a>.) These operators provide the abstractions necessary for testing complex Cascalog workflows.
</p>

</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">fact?- </h4>
<div class="outline-text-4" id="text-1-1-1">


<p>
Let's begin by defining a function to test:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">defn</span> <span style="color: #0000ff;">mk-inc-query</span> [src]
  <span style="color: #8c8c8c;">(</span>&lt;- [?a ?b]
      <span style="color: #8c8c8c;">(</span>src ?a<span style="color: #8c8c8c;">)</span>
      <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">inc</span> ?a <span style="color: #008b8b;">:&gt;</span> ?b<span style="color: #8c8c8c;">)))</span>
</pre>


<p>
<code>mk-inc-query</code> accepts a source of 1-tuples and returns a query that generates 2-tuples. To test that <code>mk-inc-query</code> actually does this, you need to:
</p>
<ul>
<li>supply <code>mk-inc-query</code> with tuples and
</li>
<li>check that it produces an expected set of result tuples.
</li>
</ul>


<p>
Each of the following forms uses the <code>fact?-</code> operator to state a distinct "fact" about our query. <code>fact?-</code> expects a sequence of result tuples followed by the query tasked with producing them.
</p>
<p>
These two facts about <code>mk-inc-query</code> are true, and pass:
</p>



<pre class="src src-clojure"><span style="color: #b22222;">;; </span><span style="color: #b22222;">The query returned by (mk-inc-query [[1]]),</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">when executed,</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">returns a single tuple: [1 2]</span>
<span style="color: #8c8c8c;">(</span>fact?- [[1 2]]
        <span style="color: #8c8c8c;">(</span>mk-inc-query [[1]]<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">fact is true!</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">The query returned by (mk-inc-query [[1] [10]]),</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">When executed,</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">returns two tuples: [10 11] and [1 2]</span>
<span style="color: #8c8c8c;">(</span>fact?- [[10 11]
         [1 2]]
        <span style="color: #8c8c8c;">(</span>mk-inc-query [[1] [10]]<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">fact is true!</span>
</pre>


<p>
This fact is false, and fails:
</p>



<pre class="src src-clojure"><span style="color: #b22222;">;; </span><span style="color: #b22222;">The query returned by (mk-inc-query [[1]]),</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">when executed,</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">returns a single tuple: ["fail!" 10].</span>
<span style="color: #8c8c8c;">(</span>fact?- [[<span style="color: #8b2252;">"fail!"</span> 10]]
        <span style="color: #8c8c8c;">(</span>mk-inc-query [[1]]<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">fact is FALSE!  </span>
</pre>


<p>
<code>fact?-</code> can take multiples pairs of result-tuples and queries:
</p>



<pre class="src src-clojure"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Same as two true facts above.</span>
<span style="color: #8c8c8c;">(</span>fact?- [[1 2]]
        <span style="color: #8c8c8c;">(</span>mk-inc-query [[1]]<span style="color: #8c8c8c;">)</span>

        [[10 11] [1 2]]
        <span style="color: #8c8c8c;">(</span>mk-inc-query [[1] [10]]<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">both facts are true!</span>
</pre>


<p>
Strings are ignored wherever they appear, so feel free to pepper your facts with comments.
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"These results:"</span>
        [[1 2]]

        <span style="color: #8b2252;">"Are produced by this query:"</span>
        <span style="color: #8c8c8c;">(</span>mk-inc-query [[1]]<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true  </span>
</pre>


<p>
Note that facts don't have to be top level forms. It's perfectly acceptable to wrap facts in <code>let</code>, if it makes the test clearer:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [src     [[1]]
      results [[1 2]]]
  <span style="color: #8c8c8c;">(</span>fact?- results <span style="color: #8c8c8c;">(</span>mk-inc-query src<span style="color: #8c8c8c;">)))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
</pre>



</div>

<div id="outline-container-1-1-1-1" class="outline-5">
<h5 id="sec-1-1-1-1">Custom Log Levels </h5>
<div class="outline-text-5" id="text-1-1-1-1">


<p>
Cascalog pipes quite a bit of logging to <code>stdout</code>. Facts suppress this logging by default, only showing entries with a FATAL log level.
</p>
<p>
If you want to see more information on fact execution, you customize the log level by placing a keyword at the beginning of your fact:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #008b8b;">:info</span>
        [[1 2]] <span style="color: #8c8c8c;">(</span>mk-inc-query [[1]]<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
</pre>


<p>
As of version 0.2.1, <code>midje-cascalog</code> supports the following log-level keywords, and defaults to <code>:fatal</code>:
</p>



<pre class="src src-clojure"><span style="color: #008b8b;">:off</span>
<span style="color: #008b8b;">:fatal</span>
<span style="color: #008b8b;">:warn</span>
<span style="color: #008b8b;">:info</span>
<span style="color: #008b8b;">:debug</span>
</pre>


</div>
</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">fact?&lt;- </h4>
<div class="outline-text-4" id="text-1-1-2">


<p>
The <code>fact?&lt;-</code> operator allows you to define a test a query within the same form. The following two facts are equivalent:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [src [[1]]]
  <span style="color: #8c8c8c;">(</span>fact?- [[1 2]]
          <span style="color: #8c8c8c;">(</span>&lt;- [?a ?b]
              <span style="color: #8c8c8c;">(</span>src ?a<span style="color: #8c8c8c;">)</span>
              <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">inc</span> ?a <span style="color: #008b8b;">:&gt;</span> ?b<span style="color: #8c8c8c;">))))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>

<span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [src [[1]]]
  <span style="color: #8c8c8c;">(</span>fact?&lt;- [[1 2]]
           [?a ?b]
           <span style="color: #8c8c8c;">(</span>src ?a<span style="color: #8c8c8c;">)</span>
           <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">inc</span> ?a <span style="color: #008b8b;">:&gt;</span> ?b<span style="color: #8c8c8c;">)))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
</pre>


<p>
Where <code>fact?-</code> is useful for testing full queries and workflows, I find <code>fact?&lt;-</code> useful mostly for testing how <code>def*op</code> functions behave inside of queries.
</p>
</div>

</div>
