org/_posts/2011-09-30-testing-cascalog-with-midje.org
*** future-fact?- and future-fact?<-

If you want to stub out an unfinished test and prevent it from throwing errors, you can use =future-fact?-=, like so:

#+begin_src clojure  
  (future-fact?- "unwritten-query will convert input integer tuples to
                 strings."
                 [["one"] ["two"]]
                 (unwritten-query [[1] [2]]))
  
  (let [src [[1] [2]]]
    (future-fact?<- "num->string is unwritten."
                    [["one"] ["two"]]
                    [?string]
                    (src ?num)
                    (num->string ?string)))
#+end_src

=future-fact?-= and =future-fact?<-= prevent their forms from being evaluated.

If you include a string at the beginning of a stubbed fact, it shows up in Midje's test report looking like this:

#+begin_src text
  WORK TO DO: unwritten-query will convert input integer tuples to strings.
  WORK TO DO: num->string is unwritten.
#+end_src

The =fact?-= and =fact?<-= operators provide the tools necessary to test complex MapReduce workflows as pure functions. Let's expand on these concepts by creating a small project with Cascalog code we'd like to test.

** Example Project

*** Dependencies

To add =midje-cascalog= support to your own project, add these entries to to the =:dev-dependencies= vector within =project.clj=:

#+begin_src clojure
  [lein-midje "1.0.3"]
  [midje-cascalog "0.2.1"]
#+end_src

And add =(:use [midje sweet cascalog])= to the namespace declaration of each of your testing namespaces.

*** Implementing Word Count

Let's begin with an implementation of word count, the typical "Hello World!" of MapReduce. A word counting application must be able to read in any number of textfiles and generate tuples of the form =[word, count]= for each distinct word across all files.

The following code accomplishes this nicely. (Bear with me! a detailed discussion follows the code block.)

#+begin_src clojure
  (ns cascalog.testing-demo.core
    (:use cascalog.api)
    (:require [cascalog.ops :as c])
    (:gen-class))

  (defmapcatop split
    "Accepts a sentence 1-tuple, splits that sentence on whitespace, and
    emits a single 1-tuple for each word."
    [^String sentence]
    (seq (.split sentence "\\s+")))

  (defn wc-query
    "Returns a subquery that generates counts for every word in
      the text-files located at `text-path`."
    [text-path]
    (let [src (hfs-textline text-path)]
      (<- [?word ?count]
          (src ?textline)
          (split ?textline :> ?word)
          (c/count ?count))))

  (defn -main
    "Accepts the following arguments:
  
     - text-path (path to a textfile, or directory with textfiles)
     - results-path (location of textfile containing results)
  
       And prints lines of the form \"word count\" to a textfile at
       results-path. Each distinct word in the textfiles at text-path
       gets a count."
    [text-path results-path]
    (?- (hfs-textline results-path)
        (wc-query text-path)))
#+end_src

The =-main= function is the entry point to the word counting program. =-main= passes =text-path= on to =wc-query=, and writes all tuples generated by the returned query to a text file at =results-path=.

All of our program's application logic occurs in the query returned by =wc-query=; this is the most important function to test. Let's discuss how =wc-query= works:

- =wc-query= is a function that returns a subquery.
- The function calls =hfs-textline= internally to generate a source of =?sentence= tuples. 
- These sentences are passed into =split=, a Cascalog function that creates words from sentences, like this:

#+begin_src clojure
  (let [sentence [["two words"]]
        words    [["two"] ["words"]]]
    (fact?<- "split converts a sentence into words."
             words
             [?word]
             (sentence ?sentence)
             (split ?sentence :> ?word)))
#+end_src

- Each word gets a count via the =cascalog.ops/count= function
- The subquery returns each =[?word ?count]= pair.

This logic looks right, but the only way to tell is to write a series of facts and see if they're true.

*** Testing Wordcount

Let's put our tests in =./test/cascalog/testing_demo/core_test.clj= (mirroring the =core.clj=, with =_test= tacked on):

#+begin_src clojure
  (ns cascalog.testing-demo.core-test
    (:use cascalog.testing-demo.core
          cascalog.api
          [midje sweet cascalog])
    (:require [cascalog.ops :as c]))
#+end_src

Here's an initial try at a test of =wc-query= using =fact?-=:

#+begin_src clojure
  ;; /path/to/textfile points to a textfile with a single line:
  ;; "another another word"
  (fact?- "wc-query should count words from all lines of text at
          /path/to/textfile."
          [["word" 1] ["another" 2]]
          (wc-query "/path/to/textfile")) ;; FALSE!
#+end_src

This fact fails. Here are a few of its problems:

- The fact depends on the way tuples are stored; it depends on an outside textfile located at a hard-coded path. If the textfile disappears, the fact will fail whether or not the logic of =wc-query= is correct.
- The fact depends on the correctness of =hfs-textline=. if =hfs-textline= fails, our fact fails.

*Testing wc-query in isolation is difficult!* How can one test the logic of =wc-query-= without regard to how lines of text are stored?

