_posts/2011-09-30-testing-cascalog-with-midje.html

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">future-fact?- and future-fact?&lt;- </h4>
<div class="outline-text-4" id="text-1-1-3">


<p>
If you want to stub out an unfinished test and prevent it from throwing errors, you can use <code>future-fact?-</code>, like so:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>future-fact?- <span style="color: #8b2252;">"unwritten-query will convert input integer tuples to</span>
<span style="color: #8b2252;">               strings."</span>
               [[<span style="color: #8b2252;">"one"</span>] [<span style="color: #8b2252;">"two"</span>]]
               <span style="color: #8c8c8c;">(</span>unwritten-query [[1] [2]]<span style="color: #8c8c8c;">))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [src [[1] [2]]]
  <span style="color: #8c8c8c;">(</span>future-fact?&lt;- <span style="color: #8b2252;">"num-&gt;string is unwritten."</span>
                  [[<span style="color: #8b2252;">"one"</span>] [<span style="color: #8b2252;">"two"</span>]]
                  [?string]
                  <span style="color: #8c8c8c;">(</span>src ?num<span style="color: #8c8c8c;">)</span>
                  <span style="color: #8c8c8c;">(</span>num-&gt;string ?string<span style="color: #8c8c8c;">)))</span>
</pre>


<p>
<code>future-fact?-</code> and <code>future-fact?&lt;-</code> prevent their forms from being evaluated.
</p>
<p>
If you include a string at the beginning of a stubbed fact, it shows up in Midje's test report looking like this:
</p>



<pre class="src src-text">WORK TO DO: unwritten-query will convert input integer tuples to strings.
WORK TO DO: num-&gt;string is unwritten.
</pre>


<p>
The <code>fact?-</code> and <code>fact?&lt;-</code> operators provide the tools necessary to test complex MapReduce workflows as pure functions. Let's expand on these concepts by creating a small project with Cascalog code we'd like to test.
</p>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Example Project </h3>
<div class="outline-text-3" id="text-1-2">



</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Dependencies </h4>
<div class="outline-text-4" id="text-1-2-1">


<p>
To add <code>midje-cascalog</code> support to your own project, add these entries to to the <code>:dev-dependencies</code> vector within <code>project.clj</code>:
</p>



<pre class="src src-clojure">[lein-midje <span style="color: #8b2252;">"1.0.3"</span>]
[midje-cascalog <span style="color: #8b2252;">"0.2.1"</span>]
</pre>


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">Implementing Word Count </h4>
<div class="outline-text-4" id="text-1-2-2">


<p>
Let's begin with an implementation of word count, the typical "Hello World!" of MapReduce. A word counting application must be able to read in any number of textfiles and generate tuples of the form <code>[word, count]</code> for each distinct word across all files.
</p>
<p>
The following code accomplishes this nicely. (Bear with me! a detailed discussion follows the code block.)
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">ns</span> cascalog.testing-demo.core
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:use</span> cascalog.api<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:require</span> [cascalog.ops <span style="color: #008b8b;">:as</span> c]<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:gen-class</span><span style="color: #8c8c8c;">))</span>

<span style="color: #8c8c8c;">(</span>defmapcatop split
  <span style="color: #8b2252;">"Accepts a sentence 1-tuple, splits that sentence on whitespace, and</span>
<span style="color: #8b2252;">  emits a single 1-tuple for each word."</span>
  [<span style="color: #228b22;">^String</span> sentence]
  <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">seq</span> <span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">.split</span> sentence <span style="color: #8b2252;">"\\s+"</span><span style="color: #8c8c8c;">)))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">defn</span> <span style="color: #0000ff;">wc-query</span>
  <span style="color: #8b2252;">"Returns a subquery that generates counts for every word in</span>
<span style="color: #8b2252;">    the text-files located at `text-path`."</span>
  [text-path]
  <span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [src <span style="color: #8c8c8c;">(</span>hfs-textline text-path<span style="color: #8c8c8c;">)</span>]
    <span style="color: #8c8c8c;">(</span>&lt;- [?word ?count]
        <span style="color: #8c8c8c;">(</span>src ?textline<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>split ?textline <span style="color: #008b8b;">:&gt;</span> ?word<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>c/count ?count<span style="color: #8c8c8c;">))))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">defn</span> <span style="color: #0000ff;">-main</span>
  <span style="color: #8b2252;">"Accepts the following arguments:</span>

<span style="color: #8b2252;">   - text-path (path to a textfile, or directory with textfiles)</span>
<span style="color: #8b2252;">   - results-path (location of textfile containing results)</span>

<span style="color: #8b2252;">     And prints lines of the form \"word count\" to a textfile at</span>
<span style="color: #8b2252;">     results-path. Each distinct word in the textfiles at text-path</span>
<span style="color: #8b2252;">     gets a count."</span>
  [text-path results-path]
  <span style="color: #8c8c8c;">(</span>?- <span style="color: #8c8c8c;">(</span>hfs-textline results-path<span style="color: #8c8c8c;">)</span>
      <span style="color: #8c8c8c;">(</span>wc-query text-path<span style="color: #8c8c8c;">)))</span>
</pre>


<p>
The <code>-main</code> function is the entry point to the word counting program. <code>-main</code> passes <code>text-path</code> on to <code>wc-query</code>, and writes all tuples generated by the returned query to a text file at <code>results-path</code>.
</p>
<p>
All of our program's application logic occurs in the query returned by <code>wc-query</code>; this is the most important function to test. Let's discuss how <code>wc-query</code> works:
</p>
<ul>
<li><code>wc-query</code> is a function that returns a subquery.
</li>
<li>The function calls <code>hfs-textline</code> internally to generate a source of <code>?sentence</code> tuples. 
</li>
<li>These sentences are passed into <code>split</code>, a Cascalog function that creates words from sentences, like this:
</li>
</ul>





<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [sentence [[<span style="color: #8b2252;">"two words"</span>]]
      words    [[<span style="color: #8b2252;">"two"</span>] [<span style="color: #8b2252;">"words"</span>]]]
  <span style="color: #8c8c8c;">(</span>fact?&lt;- <span style="color: #8b2252;">"split converts a sentence into words."</span>
           words
           [?word]
           <span style="color: #8c8c8c;">(</span>sentence ?sentence<span style="color: #8c8c8c;">)</span>
           <span style="color: #8c8c8c;">(</span>split ?sentence <span style="color: #008b8b;">:&gt;</span> ?word<span style="color: #8c8c8c;">)))</span>
</pre>


<ul>
<li>Each word gets a count via the <code>cascalog.ops/count</code> function
</li>
<li>The subquery returns each <code>[?word ?count]</code> pair.
</li>
</ul>


<p>
This logic looks right, but the only way to tell is to write a series of facts and see if they're true.
</p>
</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">Testing Wordcount </h4>
<div class="outline-text-4" id="text-1-2-3">


<p>
Let's put our tests in <code>./test/cascalog/testing_demo/core_test.clj</code> (mirroring the <code>core.clj</code>, with <code>_test</code> tacked on):
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">ns</span> cascalog.testing-demo.core-test
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:use</span> cascalog.testing-demo.core
        cascalog.api
        [midje sweet cascalog]<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:require</span> [cascalog.ops <span style="color: #008b8b;">:as</span> c]<span style="color: #8c8c8c;">))</span>
</pre>


<p>
Here's an initial try at a test of <code>wc-query</code> using <code>fact?-</code>:
</p>



<pre class="src src-clojure"><span style="color: #b22222;">;; </span><span style="color: #b22222;">/path/to/textfile points to a textfile with a single line:</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">"another another word"</span>
<span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"wc-query should count words from all lines of text at</span>
<span style="color: #8b2252;">        /path/to/textfile."</span>
        [[<span style="color: #8b2252;">"word"</span> 1] [<span style="color: #8b2252;">"another"</span> 2]]
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #8b2252;">"/path/to/textfile"</span><span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">FALSE!</span>
</pre>


<p>
This fact fails. Here are a few of its problems:
</p>
<ul>
<li>The fact depends on the way tuples are stored; it depends on an outside textfile located at a hard-coded path. If the textfile disappears, the fact will fail whether or not the logic of <code>wc-query</code> is correct.
</li>
<li>The fact depends on the correctness of <code>hfs-textline</code>. if <code>hfs-textline</code> fails, our fact fails.
</li>
</ul>


<p>
<b>Testing wc-query in isolation is difficult!</b> How can one test the logic of <code>wc-query-</code> without regard to how lines of text are stored?
</p>
</div>
</div>

</div>
