org/_posts/2011-09-30-testing-cascalog-with-midje.org
** Mocking with Midje

The solution lies in Midje's ability to mock out a function's return values. Midje can hijack =hfs-textline= and force it to return anything you choose inside the body of a fact.

*** provided

Using Midje's =provided= form, the above fact passes:

#+begin_src clojure
  (fact?- "wc-query should count words from all input sentences."
          [["word" 1] ["another" 2]]
          (wc-query :path)
          (provided
            (hfs-textline :path) => [["another another word"]])) ;; true
#+end_src

This fact states 

- when =wc-query= is called with =:path=,
- it will produce two tuples: =["word" 1]= and =["another" 2]=,
- provided =(hfs-textline :path)= produces a single tuple: =["another another word"]=.

Here's another true fact about =wc-query= that uses multiple input sentences:

#+begin_src clojure
  (def short-sentences
    [["this is a sentence sentence"]
     ["sentence with this is repeated"]])
  
  (def short-wordcounts
    [["sentence" 3]
     ["repeated" 1]
     ["is" 2]
     ["a" 1]
     ["this" 2]
     ["with" 1]])
  
  ;; when =wc-query= is called with =:text-path=
  ;; it will produce =short-sentences=,
  ;; provided =(hfs-textline :text-path)= produces =short-wordcounts=.
  (fact?- short-wordcounts (wc-query :text-path)
          (provided
            (hfs-textline :text-path) => short-sentences)) ;; true
#+end_src

A =provided= form only applies to the result-query pair directly above. The first fact is false, while the second fact is true:

#+begin_src clojure
  (let [sentence [["two words"]]
        results  [["two" 1] ["words" 1]]]
    (fact?- "provided form won't apply here!"
            results (wc-query :path) ;; false
  
            "provided applies here."
            results (wc-query :path) ;; true
            (provided
              (hfs-textline :path) => sentence)))
#+end_src

*** Mocking Arguments

In the above facts, I used keywords (=:path=) as mocking arguments. Any form that evaluates to itself can be used as a mocking argument. In vanilla Clojure, this includes strings, numbers and keywords. Midje adds any symbol surrounded by dots (=..path..=, =.path.=, etc.) to this mix.

These facts about =wc-query= from above are all true, and identical:

#+begin_src clojure
  (fact?- "Mocking with keywords,"
          [["one" 1]] (wc-query :path)
          (provided (hfs-textline :path) => [["one"]])
  
          "strings,"
          [["one" 1]] (wc-query "path")
          (provided (hfs-textline "path") => [["one"]])
  
          "numbers,"
          [["one" 1]] (wc-query 100)
          (provided (hfs-textline 100) => [["one"]])
  
          "and Midje dotted symbols."
          [["one" 1]] (wc-query ..path..)
          (provided (hfs-textline ..path..) => [["one"]]))
#+end_src

