_posts/2011-09-30-testing-cascalog-with-midje.html

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Mocking with Midje </h3>
<div class="outline-text-3" id="text-1-3">


<p>
The solution lies in Midje's ability to mock out a function's return values. Midje can hijack <code>hfs-textline</code> and force it to return anything you choose inside the body of a fact.
</p>

</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">provided </h4>
<div class="outline-text-4" id="text-1-3-1">


<p>
Using Midje's <code>provided</code> form, the above fact passes:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"wc-query should count words from all input sentences."</span>
        [[<span style="color: #8b2252;">"word"</span> 1] [<span style="color: #8b2252;">"another"</span> 2]]
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"another another word"</span>]]<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
</pre>


<p>
This fact states 
</p>
<ul>
<li>when <code>wc-query</code> is called with <code>:path</code>,
</li>
<li>it will produce two tuples: <code>["word" 1]</code> and <code>["another" 2]</code>,
</li>
<li>provided <code>(hfs-textline :path)</code> produces a single tuple: <code>["another another word"]</code>.
</li>
</ul>


<p>
Here's another true fact about <code>wc-query</code> that uses multiple input sentences:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">def</span> <span style="color: #0000ff;">short-sentences</span>
  [[<span style="color: #8b2252;">"this is a sentence sentence"</span>]
   [<span style="color: #8b2252;">"sentence with this is repeated"</span>]]<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">def</span> <span style="color: #0000ff;">short-wordcounts</span>
  [[<span style="color: #8b2252;">"sentence"</span> 3]
   [<span style="color: #8b2252;">"repeated"</span> 1]
   [<span style="color: #8b2252;">"is"</span> 2]
   [<span style="color: #8b2252;">"a"</span> 1]
   [<span style="color: #8b2252;">"this"</span> 2]
   [<span style="color: #8b2252;">"with"</span> 1]]<span style="color: #8c8c8c;">)</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">when =wc-query= is called with =:text-path=</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">it will produce =short-sentences=,</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">provided =(hfs-textline :text-path)= produces =short-wordcounts=.</span>
<span style="color: #8c8c8c;">(</span>fact?- short-wordcounts <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span> =&gt; short-sentences<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
</pre>


<p>
A <code>provided</code> form only applies to the result-query pair directly above. The first fact is false, while the second fact is true:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [sentence [[<span style="color: #8b2252;">"two words"</span>]]
      results  [[<span style="color: #8b2252;">"two"</span> 1] [<span style="color: #8b2252;">"words"</span> 1]]]
  <span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"provided form won't apply here!"</span>
          results <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">false</span>

          <span style="color: #8b2252;">"provided applies here."</span>
          results <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
          <span style="color: #8c8c8c;">(</span>provided
            <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; sentence<span style="color: #8c8c8c;">)))</span>
</pre>


</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">Mocking Arguments </h4>
<div class="outline-text-4" id="text-1-3-2">


<p>
In the above facts, I used keywords (<code>:path</code>) as mocking arguments. Any form that evaluates to itself can be used as a mocking argument. In vanilla Clojure, this includes strings, numbers and keywords. Midje adds any symbol surrounded by dots (<code>..path..</code>, <code>.path.</code>, etc.) to this mix.
</p>
<p>
These facts about <code>wc-query</code> from above are all true, and identical:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"Mocking with keywords,"</span>
        [[<span style="color: #8b2252;">"one"</span> 1]] <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"one"</span>]]<span style="color: #8c8c8c;">)</span>

        <span style="color: #8b2252;">"strings,"</span>
        [[<span style="color: #8b2252;">"one"</span> 1]] <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #8b2252;">"path"</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #8b2252;">"path"</span><span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"one"</span>]]<span style="color: #8c8c8c;">)</span>

        <span style="color: #8b2252;">"numbers,"</span>
        [[<span style="color: #8b2252;">"one"</span> 1]] <span style="color: #8c8c8c;">(</span>wc-query 100<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided <span style="color: #8c8c8c;">(</span>hfs-textline 100<span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"one"</span>]]<span style="color: #8c8c8c;">)</span>

        <span style="color: #8b2252;">"and Midje dotted symbols."</span>
        [[<span style="color: #8b2252;">"one"</span> 1]] <span style="color: #8c8c8c;">(</span>wc-query ..path..<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided <span style="color: #8c8c8c;">(</span>hfs-textline ..path..<span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"one"</span>]]<span style="color: #8c8c8c;">))</span>
</pre>


</div>

</div>
