org/_posts/2011-09-30-testing-cascalog-with-midje.org
*** against-background

As discussed, the =provided= form only applies to the result-query pair directly above. This limitation can make for repetitive facts, when each fact depends on a mocked result:

#+begin_src clojure
  (defn text->words [path]
    (let [src (hfs-textline path)]
      (<- [?word]
          (src ?sentence)
          (split ?sentence :> ?word)
          (:distinct false))))
  
  (let [sentence [["two two"]]]
    (fact?- "text->words cuts text into words."
            [["two"] ["two"]] (text->words :path)
            (provided
              (hfs-textline :path) => sentence)
  
            "wc-query converts a sentence into words."
            [["two" 2]] (wc-query :path)
            (provided
              (hfs-textline :path) => sentence)))
  
#+end_src

Midje allows facts to share mocked functions with =against-background=. An =against-background= form placed anywhere inside the body of =fact?-= will apply to all facts inside the form:

#+begin_src clojure
  (let [sentence [["two two"]]]
    (fact?- "text->words cuts text into words."
            [["two"] ["two"]] (text->words :path)
            
            "wc-query converts a sentence into words."
            [["two" 2]]
            (wc-query :path)
            
            "wc-query fact with difference inputs."
            [["what" 1] ["a" 1] ["world!" 1]]
            (wc-query :path)
            (provided
              (hfs-textline :path) => [["what a world!"]])
        
            (against-background
              (hfs-textline :path) => sentence)))
#+end_src

Note that the third of the three above facts used its own =provided= form. When the two forms are mixed, =provided= takes precedence, shadowing =against-background= if need be (as above).

** Collection Checkers

For the next set of facts, let's introduce a larger set of input sentences:

#+begin_src clojure
  (def longer-sentences
    [["Call me Ishmael. Some years ago -- never mind how long"]
     ["precisely -- having little or no money in my purse, and"]
     ["nothing particular to interest me on shore, I thought I"]
     ["would sail about a little and see the watery part of the world."]])
#+end_src

One issue with the above facts is that they use very small input sentences. =wc-query= will produce a rather large sequence of =<word, count>= pairs for a moderate number of input sentences. Facts like this are overwhelming:

#+begin_src clojure
  (fact?- [["Ishmael." 1]
           ["Some" 1]
           ["a" 1]
           ["about" 1]
           ["ago" 1]
           ;; and on and on...
           ]
          (wc-query :path)
          (provided (hfs-textline :path) => longer-sentences))
#+end_src

To solve this, Midje provides a number of collection checkers that provide you with finer control over how queries are compared with result sequences.

*** just

=just= is the default checker for =fact?-= and =fact?<-=; bare vectors of tuples resolve to =(just result-vec :in-any-order)=. The following three facts are equivalent:

#+begin_src clojure  
  (let [src   [[1] [2]]
        query (<- [?a ?b]
                  (src ?a)
                  (inc ?a :> ?b))]
    (fact?- "Just form, fully qualified."
            (just [[2 3] [1 2]] :in-any-order) query ;;true
  
            "Wrapping tuples in a set is indentical to including
             the :in-any-order modifier."
            (just #{[2 3] [1 2]}) query ;; true
            
            "midje-cascalog lets us drop these wrappers."
            [[2 3] [1 2]] query)) ;; true
#+end_src

Each of these facts checks that its subquery returns =[2 3]= =[1 2]= exclusively, in any order. Any missing or extra tuples in the result vector will cause a failure.

Note that dropping the =:in-any-order= modifier (or the set wrapper) will cause facts to fail if ordering doesn't match. This makes sense sometimes when checking against top-n queries, as noted in the discussion below on [[has-prefix]].

