_posts/2011-09-30-testing-cascalog-with-midje.html

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">against-background </h4>
<div class="outline-text-4" id="text-1-3-3">


<p>
As discussed, the <code>provided</code> form only applies to the result-query pair directly above. This limitation can make for repetitive facts, when each fact depends on a mocked result:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">defn</span> <span style="color: #0000ff;">text-&gt;words</span> [path]
  <span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [src <span style="color: #8c8c8c;">(</span>hfs-textline path<span style="color: #8c8c8c;">)</span>]
    <span style="color: #8c8c8c;">(</span>&lt;- [?word]
        <span style="color: #8c8c8c;">(</span>src ?sentence<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>split ?sentence <span style="color: #008b8b;">:&gt;</span> ?word<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:distinct</span> false<span style="color: #8c8c8c;">))))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [sentence [[<span style="color: #8b2252;">"two two"</span>]]]
  <span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"text-&gt;words cuts text into words."</span>
          [[<span style="color: #8b2252;">"two"</span>] [<span style="color: #8b2252;">"two"</span>]] <span style="color: #8c8c8c;">(</span>text-&gt;words <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
          <span style="color: #8c8c8c;">(</span>provided
            <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; sentence<span style="color: #8c8c8c;">)</span>

          <span style="color: #8b2252;">"wc-query converts a sentence into words."</span>
          [[<span style="color: #8b2252;">"two"</span> 2]] <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
          <span style="color: #8c8c8c;">(</span>provided
            <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; sentence<span style="color: #8c8c8c;">)))</span>

</pre>


<p>
Midje allows facts to share mocked functions with <code>against-background</code>. An <code>against-background</code> form placed anywhere inside the body of <code>fact?-</code> will apply to all facts inside the form:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [sentence [[<span style="color: #8b2252;">"two two"</span>]]]
  <span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"text-&gt;words cuts text into words."</span>
          [[<span style="color: #8b2252;">"two"</span>] [<span style="color: #8b2252;">"two"</span>]] <span style="color: #8c8c8c;">(</span>text-&gt;words <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>

          <span style="color: #8b2252;">"wc-query converts a sentence into words."</span>
          [[<span style="color: #8b2252;">"two"</span> 2]]
          <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>

          <span style="color: #8b2252;">"wc-query fact with difference inputs."</span>
          [[<span style="color: #8b2252;">"what"</span> 1] [<span style="color: #8b2252;">"a"</span> 1] [<span style="color: #8b2252;">"world!"</span> 1]]
          <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
          <span style="color: #8c8c8c;">(</span>provided
            <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"what a world!"</span>]]<span style="color: #8c8c8c;">)</span>

          <span style="color: #8c8c8c;">(</span>against-background
            <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; sentence<span style="color: #8c8c8c;">)))</span>
</pre>


<p>
Note that the third of the three above facts used its own <code>provided</code> form. When the two forms are mixed, <code>provided</code> takes precedence, shadowing <code>against-background</code> if need be (as above).
</p>
</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Collection Checkers </h3>
<div class="outline-text-3" id="text-1-4">


<p>
For the next set of facts, let's introduce a larger set of input sentences:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">def</span> <span style="color: #0000ff;">longer-sentences</span>
  [[<span style="color: #8b2252;">"Call me Ishmael. Some years ago -- never mind how long"</span>]
   [<span style="color: #8b2252;">"precisely -- having little or no money in my purse, and"</span>]
   [<span style="color: #8b2252;">"nothing particular to interest me on shore, I thought I"</span>]
   [<span style="color: #8b2252;">"would sail about a little and see the watery part of the world."</span>]]<span style="color: #8c8c8c;">)</span>
</pre>


<p>
One issue with the above facts is that they use very small input sentences. <code>wc-query</code> will produce a rather large sequence of <code>&lt;word, count&gt;</code> pairs for a moderate number of input sentences. Facts like this are overwhelming:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- [[<span style="color: #8b2252;">"Ishmael."</span> 1]
         [<span style="color: #8b2252;">"Some"</span> 1]
         [<span style="color: #8b2252;">"a"</span> 1]
         [<span style="color: #8b2252;">"about"</span> 1]
         [<span style="color: #8b2252;">"ago"</span> 1]
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">and on and on...</span>
         ]
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; longer-sentences<span style="color: #8c8c8c;">))</span>
</pre>


<p>
To solve this, Midje provides a number of collection checkers that provide you with finer control over how queries are compared with result sequences.
</p>

</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">just </h4>
<div class="outline-text-4" id="text-1-4-1">


<p>
<code>just</code> is the default checker for <code>fact?-</code> and <code>fact?&lt;-</code>; bare vectors of tuples resolve to <code>(just result-vec :in-any-order)</code>. The following three facts are equivalent:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [src   [[1] [2]]
      query <span style="color: #8c8c8c;">(</span>&lt;- [?a ?b]
                <span style="color: #8c8c8c;">(</span>src ?a<span style="color: #8c8c8c;">)</span>
                <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">inc</span> ?a <span style="color: #008b8b;">:&gt;</span> ?b<span style="color: #8c8c8c;">))</span>]
  <span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"Just form, fully qualified."</span>
          <span style="color: #8c8c8c;">(</span>just [[2 3] [1 2]] <span style="color: #008b8b;">:in-any-order</span><span style="color: #8c8c8c;">)</span> query <span style="color: #b22222;">;;</span><span style="color: #b22222;">true</span>

          <span style="color: #8b2252;">"Wrapping tuples in a set is indentical to including</span>
<span style="color: #8b2252;">           the :in-any-order modifier."</span>
          <span style="color: #8c8c8c;">(</span>just #{[2 3] [1 2]}<span style="color: #8c8c8c;">)</span> query <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>

          <span style="color: #8b2252;">"midje-cascalog lets us drop these wrappers."</span>
          [[2 3] [1 2]] query<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
</pre>


<p>
Each of these facts checks that its subquery returns <code>[2 3]</code> <code>[1 2]</code> exclusively, in any order. Any missing or extra tuples in the result vector will cause a failure.
</p>
<p>
Note that dropping the <code>:in-any-order</code> modifier (or the set wrapper) will cause facts to fail if ordering doesn't match. This makes sense sometimes when checking against top-n queries, as noted in the discussion below on <a href="#sec-1-4-3">has-prefix</a>.
</p>
</div>

</div>
