org/_posts/2011-09-30-testing-cascalog-with-midje.org
*** contains

The =contains= form allows facts to check against a subset of query tuples. By default, =contains= requires result tuples to be contiguous and ordered: =[1 2]= within =[3 4 1 2 1]=, for example.

These restrictions are quite limiting for most Cascalog queries. The following two facts avoid both restrictions:

#+begin_src clojure
  (fact?- (contains #{["sail" 1] ["Ishmael." 1]} :gaps-ok)
          (wc-query :path) ;; true
          
          (contains [["sail" 1] ["Ishmael." 1]] :gaps-ok :in-any-order)
          (wc-query :path) ;; true
  
          (against-background
            (hfs-textline :path) => longer-sentences))
#+end_src

The above facts test that both =["sail" 1]= and =["Ishmael." 1]= appear somewhere in the results, in any order. 

- Wrapping the result tuples in a set (vs. a vector), or adding the =:in-any-order= keyword, relaxes the ordering restriction.
- The =:gaps-ok= keyword relaxes the restriction that tuples must contiguous.

*** has-prefix

=has-prefix= checks that the supplied tuple sequence appears at the beginning of the query's results. =has-prefix= only makes sense with queries that return sorted tuples.

The following fact states that =["--" 2]=, =["I" 2]= and =["and" 2]=, in order, are the three most common words across all words in =longer-sentences=:

#+begin_src clojure
  (fact?- (has-prefix [["--" 2] ["I" 2] ["and" 2]])
          (-> (wc-query :path)
              (c/first-n 10 :sort ["?count"] :reverse true))
          (provided
            (hfs-textline :path) => longer-sentences)) ;; true
#+end_src

*** has-suffix

=has-suffix= checks that the supplied tuple sequence appears at the end of the query's results.

The following fact states that =["world." 1]=, =["would" 1]= and =["years" 2]=, in order, are the last three words (by alphabetical order) across all words in =longer-sentences=:

#+begin_src clojure
  (fact?- (has-suffix [["world." 1] ["would" 1] ["years" 1]])
          (-> (wc-query :text-path)
              (c/first-n 100 :sort ["?word"]))
          (provided
            (hfs-textline :text-path) => longer-sentences)) ;; true
#+end_src

As with =has-prefix=, facts making use of =has-suffix= only make sense when specifically testing tuple ordering.

