_posts/2011-09-30-testing-cascalog-with-midje.html

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">contains </h4>
<div class="outline-text-4" id="text-1-4-2">


<p>
The <code>contains</code> form allows facts to check against a subset of query tuples. By default, <code>contains</code> requires result tuples to be contiguous and ordered: <code>[1 2]</code> within <code>[3 4 1 2 1]</code>, for example.
</p>
<p>
These restrictions are quite limiting for most Cascalog queries. The following two facts avoid both restrictions:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8c8c8c;">(</span>contains #{[<span style="color: #8b2252;">"sail"</span> 1] [<span style="color: #8b2252;">"Ishmael."</span> 1]} <span style="color: #008b8b;">:gaps-ok</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>

        <span style="color: #8c8c8c;">(</span>contains [[<span style="color: #8b2252;">"sail"</span> 1] [<span style="color: #8b2252;">"Ishmael."</span> 1]] <span style="color: #008b8b;">:gaps-ok</span> <span style="color: #008b8b;">:in-any-order</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>

        <span style="color: #8c8c8c;">(</span>against-background
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; longer-sentences<span style="color: #8c8c8c;">))</span>
</pre>


<p>
The above facts test that both <code>["sail" 1]</code> and <code>["Ishmael." 1]</code> appear somewhere in the results, in any order. 
</p>
<ul>
<li>Wrapping the result tuples in a set (vs. a vector), or adding the <code>:in-any-order</code> keyword, relaxes the ordering restriction.
</li>
<li>The <code>:gaps-ok</code> keyword relaxes the restriction that tuples must contiguous.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">has-prefix </h4>
<div class="outline-text-4" id="text-1-4-3">


<p>
<code>has-prefix</code> checks that the supplied tuple sequence appears at the beginning of the query's results. <code>has-prefix</code> only makes sense with queries that return sorted tuples.
</p>
<p>
The following fact states that <code>["--" 2]</code>, <code>["I" 2]</code> and <code>["and" 2]</code>, in order, are the three most common words across all words in <code>longer-sentences</code>:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8c8c8c;">(</span>has-prefix [[<span style="color: #8b2252;">"--"</span> 2] [<span style="color: #8b2252;">"I"</span> 2] [<span style="color: #8b2252;">"and"</span> 2]]<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">-&gt;</span> <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
            <span style="color: #8c8c8c;">(</span>c/first-n 10 <span style="color: #008b8b;">:sort</span> [<span style="color: #8b2252;">"?count"</span>] <span style="color: #008b8b;">:reverse</span> true<span style="color: #8c8c8c;">))</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; longer-sentences<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
</pre>


</div>

</div>

<div id="outline-container-1-4-4" class="outline-4">
<h4 id="sec-1-4-4">has-suffix </h4>
<div class="outline-text-4" id="text-1-4-4">


<p>
<code>has-suffix</code> checks that the supplied tuple sequence appears at the end of the query's results.
</p>
<p>
The following fact states that <code>["world." 1]</code>, <code>["would" 1]</code> and <code>["years" 2]</code>, in order, are the last three words (by alphabetical order) across all words in <code>longer-sentences</code>:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8c8c8c;">(</span>has-suffix [[<span style="color: #8b2252;">"world."</span> 1] [<span style="color: #8b2252;">"would"</span> 1] [<span style="color: #8b2252;">"years"</span> 1]]<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">-&gt;</span> <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span>
            <span style="color: #8c8c8c;">(</span>c/first-n 100 <span style="color: #008b8b;">:sort</span> [<span style="color: #8b2252;">"?word"</span>]<span style="color: #8c8c8c;">))</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span> =&gt; longer-sentences<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
</pre>


<p>
As with <code>has-prefix</code>, facts making use of <code>has-suffix</code> only make sense when specifically testing tuple ordering.
</p>
</div>
</div>

</div>
