org/_posts/2011-09-30-testing-cascalog-with-midje.org
** Tabular

In certain cases, you might like to test a single query against a wide range of inputs and outputs. This quickly grows repetitive:

#+begin_src clojure
  (fact?- [["mock" 1] ["it" 1] ["out!" 1]]
          (wc-query :path)
          (provided
            (hfs-textline :path) => [["mock it out!"]]) ;;true
  
          [["two" 3]]
          (wc-query :path)
          (provided
            (hfs-textline :path) => [["two two two"]]) ;;true
  
          [["M.M" 1] ["nathan" 1]]
          (wc-query :path)
          (provided
            (hfs-textline :path) => [["nathan M.M"]])) ;; true
#+end_src

Gah! =against-background= doesn't work here, since these facts mock against different sentences each time.

Midje's =tabular= form provides an elegant way to collapse this repetition:

#+begin_src clojure
  (tabular
   (fact?- "Tabular generates lots of facts, one for each set of
           substitutions in the table below."
           ?results
           (wc-query :path)
           (provided
             (hfs-textline :path) => [[?sentence]]))
   ?sentence       ?results
   "mock it out!"  [["mock" 1] ["it" 1] ["out!" 1]]
   "two two two"   [["two" 3]]
   "nathan M.M"    [["M.M" 1] ["nathan" 1]]) ;; 3 true facts
#+end_src

(This one's a little involved, but the results are really beautiful.)

=tabular= accepts three types of arguments:

- a single =fact?-= or =fact?<-= templating form
- a number of "templating variables" that start with =?= (=?sentence= and =?results=, in the above fact)
- any number of rows of substitutions (the above fact has three)

and generates a separate fact for every substitution row. It does this by substituting each value into the templating form in place of the header variable at the top of column.

The first fact generated by the above tabular fact looks like this:

#+begin_src clojure
  (tabular
   ;; Tabular takes this templating form:
   (fact?- "Tabular generates lots of facts, one for each set of
             substitutions in the table below."
           ?results
           (wc-query :path)
           (provided
             (hfs-textline :path) => [[?sentence]]))
  
   ;; and substitutes these variables:
   ?sentence       ?results
   "mock it out!"  [["mock" 1] ["it" 1] ["out!" 1]]) ;; true
  
  ;; to produce this fact:
  (fact?- [["mock" 1] ["it" 1] ["out!" 1]]
          (wc-query :path)
          (provided
            (hfs-textline :path) => [["mock it out!"]])) ;; true
#+end_src

Any variable prefixed by =?= that appears inside both the fact template AND the header variables row is earmarked for substitution. This means that cascalog dynamic variables are totally safe, and play well with tabular.

** Running Tests

*** lein-midje

Once you write facts within a project, you can use [[https://github.com/marick/Midje/wiki/Lein-midje][lein-midje]] to run them all and generate a summary like this:

#+begin_src text
  Checking function: (midje.sweet/just [["Ishmael." 1] ["Some" 1] ["a" 1] ["about" 1] ["ago" 1]] :in-any-order)
  The checker said this about the reason:
      Expected five elements. There were thirty-nine.
  FAILURE: 6 facts were not confirmed. (But 37 were.)
#+end_src

If you're using the leiningen build manager, follow these steps:

- Add  =[lein-midje "1.0.3"]= to the =:dev-dependencies= entry in your =project.clj=
- Run =lein midje= at the command line in your project's root directory.

This command runs all facts and tests in the project and prints a summary of all results to stdout.

If you're using Cake, follow the steps on the [[https://github.com/marick/Midje/wiki/Cake-midje][Midje wiki]] for installing and running =cake midje=.

*** Interaction with clojure.test

If you currently write =deftest= style tests using clojure.test, check out [[https://github.com/marick/Midje/wiki/Migrating-from-clojure.test][Midje's tips]] on integration. The two modes work very well together. =lein midje= and =cake midje= will evaluate all =deftest= forms inside of a project and include the results in its report.

** In Conclusion

I believe that midje-cascalog is the most advanced MapReduce testing suite available today. The primitives discussed here make testing Cascalog queries a joy; the confidence that comes from fully tested components is a prerequisitive for creative work at large scale.

Please let me know what you think of the project! I'm happy to extend midje-cascalog in any way that helps the cause. Have fun testing!
