_posts/2011-09-30-testing-cascalog-with-midje.html

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">Tabular </h3>
<div class="outline-text-3" id="text-1-5">


<p>
In certain cases, you might like to test a single query against a wide range of inputs and outputs. This quickly grows repetitive:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- [[<span style="color: #8b2252;">"mock"</span> 1] [<span style="color: #8b2252;">"it"</span> 1] [<span style="color: #8b2252;">"out!"</span> 1]]
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"mock it out!"</span>]]<span style="color: #8c8c8c;">)</span> <span style="color: #b22222;">;;</span><span style="color: #b22222;">true</span>

        [[<span style="color: #8b2252;">"two"</span> 3]]
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"two two two"</span>]]<span style="color: #8c8c8c;">)</span> <span style="color: #b22222;">;;</span><span style="color: #b22222;">true</span>

        [[<span style="color: #8b2252;">"M.M"</span> 1] [<span style="color: #8b2252;">"nathan"</span> 1]]
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"nathan M.M"</span>]]<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
</pre>


<p>
Gah! <code>against-background</code> doesn't work here, since these facts mock against different sentences each time.
</p>
<p>
Midje's <code>tabular</code> form provides an elegant way to collapse this repetition:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>tabular
 <span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"Tabular generates lots of facts, one for each set of</span>
<span style="color: #8b2252;">         substitutions in the table below."</span>
         ?results
         <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
         <span style="color: #8c8c8c;">(</span>provided
           <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; [[?sentence]]<span style="color: #8c8c8c;">))</span>
 ?sentence       ?results
 <span style="color: #8b2252;">"mock it out!"</span>  [[<span style="color: #8b2252;">"mock"</span> 1] [<span style="color: #8b2252;">"it"</span> 1] [<span style="color: #8b2252;">"out!"</span> 1]]
 <span style="color: #8b2252;">"two two two"</span>   [[<span style="color: #8b2252;">"two"</span> 3]]
 <span style="color: #8b2252;">"nathan M.M"</span>    [[<span style="color: #8b2252;">"M.M"</span> 1] [<span style="color: #8b2252;">"nathan"</span> 1]]<span style="color: #8c8c8c;">)</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">3 true facts</span>
</pre>


<p>
(This one's a little involved, but the results are really beautiful.)
</p>
<p>
<code>tabular</code> accepts three types of arguments:
</p>
<ul>
<li>a single <code>fact?-</code> or <code>fact?&lt;-</code> templating form
</li>
<li>a number of "templating variables" that start with <code>?</code> (<code>?sentence</code> and <code>?results</code>, in the above fact)
</li>
<li>any number of rows of substitutions (the above fact has three)
</li>
</ul>


<p>
and generates a separate fact for every substitution row. It does this by substituting each value into the templating form in place of the header variable at the top of column.
</p>
<p>
The first fact generated by the above tabular fact looks like this:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>tabular
 <span style="color: #b22222;">;; </span><span style="color: #b22222;">Tabular takes this templating form:</span>
 <span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"Tabular generates lots of facts, one for each set of</span>
<span style="color: #8b2252;">           substitutions in the table below."</span>
         ?results
         <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
         <span style="color: #8c8c8c;">(</span>provided
           <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; [[?sentence]]<span style="color: #8c8c8c;">))</span>

 <span style="color: #b22222;">;; </span><span style="color: #b22222;">and substitutes these variables:</span>
 ?sentence       ?results
 <span style="color: #8b2252;">"mock it out!"</span>  [[<span style="color: #8b2252;">"mock"</span> 1] [<span style="color: #8b2252;">"it"</span> 1] [<span style="color: #8b2252;">"out!"</span> 1]]<span style="color: #8c8c8c;">)</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">to produce this fact:</span>
<span style="color: #8c8c8c;">(</span>fact?- [[<span style="color: #8b2252;">"mock"</span> 1] [<span style="color: #8b2252;">"it"</span> 1] [<span style="color: #8b2252;">"out!"</span> 1]]
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"mock it out!"</span>]]<span style="color: #8c8c8c;">))</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">true</span>
</pre>


<p>
Any variable prefixed by <code>?</code> that appears inside both the fact template AND the header variables row is earmarked for substitution. This means that cascalog dynamic variables are totally safe, and play well with tabular.
</p>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">Running Tests </h3>
<div class="outline-text-3" id="text-1-6">



</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">lein-midje </h4>
<div class="outline-text-4" id="text-1-6-1">


<p>
Once you write facts within a project, you can use <a href="https://github.com/marick/Midje/wiki/Lein-midje">lein-midje</a> to run them all and generate a summary like this:
</p>



<pre class="src src-text">Checking function: (midje.sweet/just [["Ishmael." 1] ["Some" 1] ["a" 1] ["about" 1] ["ago" 1]] :in-any-order)
The checker said this about the reason:
    Expected five elements. There were thirty-nine.
FAILURE: 6 facts were not confirmed. (But 37 were.)
</pre>


<p>
If you're using the leiningen build manager, follow these steps:
</p>
<ul>
<li>Add  <code>[lein-midje "1.0.3"]</code> to the <code>:dev-dependencies</code> entry in your <code>project.clj</code>
</li>
<li>Run <code>lein midje</code> at the command line in your project's root directory.
</li>
</ul>


<p>
This command runs all facts and tests in the project and prints a summary of all results to stdout.
</p>
<p>
If you're using Cake, follow the steps on the <a href="https://github.com/marick/Midje/wiki/Cake-midje">Midje wiki</a> for installing and running <code>cake midje</code>.
</p>
</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2">Interaction with clojure.test </h4>
<div class="outline-text-4" id="text-1-6-2">


<p>
If you currently write <code>deftest</code> style tests using clojure.test, check out <a href="https://github.com/marick/Midje/wiki/Migrating-from-clojure.test">Midje's tips</a> on integration. The two modes work very well together. <code>lein midje</code> and <code>cake midje</code> will evaluate all <code>deftest</code> forms inside of a project and include the results in its report.
</p>
</div>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">In Conclusion </h3>
<div class="outline-text-3" id="text-1-7">


<p>
I believe that midje-cascalog is the most advanced MapReduce testing suite available today. The primitives discussed here make testing Cascalog queries a joy; the confidence that comes from fully tested components is a prerequisitive for creative work at large scale.
</p>
<p>
Please let me know what you think of the project! I'm happy to extend midje-cascalog in any way that helps the cause. Have fun testing!
</p></div>
</div>
</div>
